artillery/medium.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 1000
      name: "Carga media (50 req/s)"
  defaults:
    headers:
      Accept: "application/json"

scenarios:
  - name: "Round-robin balanceo"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - get:
          url: "/health"
          expect:
            - statusCode: 200